        //問題
var qs=["だいまるの 年齢はいくつ？",
        "だいまるの 出身地はどこ？",
        "だいまるの ハムスターの名前は？",
        "だいまるの 入っていたサークルは？",
        "ねむい",
        "だいまるの 好きなラーメンは？"
];

//回答
var toi=[
    ["２１歳","２２歳","２３歳","２４歳"],
    ["茨城県","埼玉県","神奈川県","熊本県"],
    ["ももこ","はなこ","もなか","ゆうこ"],
    ["バスケ部","よさこい","卓球部","テ二ス部"],
    ["ほんと","それな","マジで","ねむい"],
    ["醤油","塩","家系","味噌"]
];
        
//さぶ
var sv=[
    ["大丸 渓一郎","セカイを変えるギークになる男",""],
    ["東京農業大学","大丸の母校",""],
    ["最近ハムスター飼いました","めっちゃ可愛いです",""],
    ["趣味","最近ニンテンドースイッチ買いました",""],
    ["今日の睡眠時間","４時間です",""],
    ["ラーメン","みんな大好き",""]
];


$("#qs").html(qs[i]);
$("#n1").html(toi[i][0]);
$("#n2").html(toi[i][1]);
$("#n3").html(toi[i][2]);
$("#n4").html(toi[i][3]);
$("#s1").html(sv[i][0]);
$("#s2").html(sv[i][1]);
$("#s3").html(sv[i][2]);
////クリック後の処理
$("[name=toi]").on("click",function(){
    if($(this).val()==ans[i]){
                alert("大当たり！！");
                s++;
            }else{
                alert("boooooo!!!")
            }{
                //点数加算
    $("#score").html("SCORE:"+s*10);
            }
    i++;
    
    //問題の終了
if(i<qs.length){
    //次の問題へ
$("#qs").html(qs[i]);
$("#n1").html(toi[i][0]);
$("#n2").html(toi[i][1]);
$("#n3").html(toi[i][2]);
$("#n4").html(toi[i][3]);
$("#s1").html(sv[i][0]);
$("#s2").html(sv[i][1]);
$("#s3").html(sv[i][2]);

    //終わり
}else{
    window.location.href="./final.html"
        }
});
        
